Import necessary packages

In [1]:
import pandas as pd
from datetime import datetime, timedelta

Import data

In [2]:
relative_path = "US-Retail-Sales-Data-Analysis/Data/monthly_retail_trade_report_1992to05.2023.xlsx"
start_row = 4
end_row = 70
columns_range = "B:N"
active_sheet = "2022"
df_2022 = pd.read_excel(relative_path, sheet_name=active_sheet, header=None,skiprows=start_row,nrows=end_row-start_row+1,usecols=columns_range)
print(df_2022)

                                                   1          2          3   \
0                                                 NaN  Jan. 2022  Feb. 2022
1                                        NOT ADJUSTED        NaN        NaN
2               Retail and food services sales, total     583761     577319
3   Retail sales and food services excl motor vehi...     469700     459828
4   Retail sales and food services excl gasoline s...     536142     529214
..                                                ...        ...        ...
62                  Food services and drinking places      66838      69418
63                                    Drinking places        (S)        (S)
64                Restaurants and other eating places      60875      62575
65                           Full service restaurants        (S)        (S)
66                      Limited service eating places      31486      31293

           4          5         6          7          8          9   \
0   Mar. 2022  Apr. 2022  May 2022  Jun. 2022  Jul. 2022  Aug. 2022
1         NaN        NaN       NaN        NaN        NaN        NaN
2      679465     679473    702760     693577     685483     698833
3      539027     542012    570623     561127     557906     562924
4      616940     616286    631649     620064     613183     632519
..        ...        ...       ...        ...        ...        ...
62      80924      82783     86134      83834      85554      85325
63        (S)        (S)       (S)        (S)        (S)        (S)
64      72750      73965     77134      75269      77477      76763
65        (S)        (S)       (S)        (S)        (S)        (S)
66      36574      37090     38926      38751      39837      39236

           10         11         12         13
0   Sep. 2022  Oct. 2022  Nov. 2022  Dec. 2022
1         NaN        NaN        NaN        NaN
2      660765     683198     684790     741521
3      535423     556461     567249     618540
4      600510     620095     627076     688622
..        ...        ...        ...        ...
62      82799      86028      79585      86696
63        (S)        (S)        (S)        (S)
64      73117      75740      70367      76944
65        (S)        (S)        (S)        (S)
66      37190      38445      35883      37620

[67 rows x 13 columns]

Data Cleaning

In [3]:
df_2022.head()

,1,2,3,4,5,6,7,8,9,10,11,12,13
0,NaN,Jan. 2022,Feb. 2022,Mar. 2022,Apr. 2022,May 2022,Jun. 2022,Jul. 2022,Aug. 2022,Sep. 2022,Oct. 2022,Nov. 2022,Dec. 2022
1,NOT ADJUSTED,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"Retail and food services sales, total",583761,577319,679465,679473,702760,693577,685483,698833,660765,683198,684790,741521
3,Retail sales and food services excl motor vehi...,469700,459828,539027,542012,570623,561127,557906,562924,535423,556461,567249,618540
4,Retail sales and food services excl gasoline s...,536142,529214,616940,616286,631649,620064,613183,632519,600510,620095,627076,688622

In [4]:
df_2022.rename(columns={1:"Kind of Business"},inplace=True)
df_2022.head()

,Kind of Business,2,3,4,5,6,7,8,9,10,11,12,13
0,NaN,Jan. 2022,Feb. 2022,Mar. 2022,Apr. 2022,May 2022,Jun. 2022,Jul. 2022,Aug. 2022,Sep. 2022,Oct. 2022,Nov. 2022,Dec. 2022
1,NOT ADJUSTED,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"Retail and food services sales, total",583761,577319,679465,679473,702760,693577,685483,698833,660765,683198,684790,741521
3,Retail sales and food services excl motor vehi...,469700,459828,539027,542012,570623,561127,557906,562924,535423,556461,567249,618540
4,Retail sales and food services excl gasoline s...,536142,529214,616940,616286,631649,620064,613183,632519,600510,620095,627076,688622

In [9]:
def first_days_of_months(year):
    first_days = []
    for month in range(1, 13):
        first_day = datetime(year, month, 1)
        first_days.append(first_day)
    return first_days

year = 2022
months_2022 = first_days_of_months(year)

column_mapping = {i: date.strftime("%Y-%m-%d") for i, date in enumerate(months_2022, start=2)}

df_2022.rename(columns=column_mapping, inplace=True)

print(df_2022.head())

Before renaming columns:
                                    Kind of Business       2       3       4  \
2              Retail and food services sales, total  583761  577319  679465
3  Retail sales and food services excl motor vehi...  469700  459828  539027
4  Retail sales and food services excl gasoline s...  536142  529214  616940
5  Retail sales and food services excl motor vehi...  422081  411723  476502
6                                Retail sales, total  516923  507901  598541

        5       6       7       8       9      10      11      12      13
2  679473  702760  693577  685483  698833  660765  683198  684790  741521
3  542012  570623  561127  557906  562924  535423  556461  567249  618540
4  616286  631649  620064  613183  632519  600510  620095  627076  688622
5  478825  499512  487614  485606  496610  475168  493358  509535  565641
6  596690  616626  609743  599929  613508  577966  597170  605205  654825
After renaming columns:
                                    Kind of Business 2022-01-01 2022-02-01  \
2              Retail and food services sales, total     583761     577319
3  Retail sales and food services excl motor vehi...     469700     459828
4  Retail sales and food services excl gasoline s...     536142     529214
5  Retail sales and food services excl motor vehi...     422081     411723
6                                Retail sales, total     516923     507901

  2022-03-01 2022-04-01 2022-05-01 2022-06-01 2022-07-01 2022-08-01  \
2     679465     679473     702760     693577     685483     698833
3     539027     542012     570623     561127     557906     562924
4     616940     616286     631649     620064     613183     632519
5     476502     478825     499512     487614     485606     496610
6     598541     596690     616626     609743     599929     613508

  2022-09-01 2022-10-01 2022-11-01 2022-12-01
2     660765     683198     684790     741521
3     535423     556461     567249     618540
4     600510     620095     627076     688622
5     475168     493358     509535     565641
6     577966     597170     605205     654825

In [6]:
df_2022 = df_2022.loc[2:]
df_2022.head()

,Kind of Business,2,3,4,5,6,7,8,9,10,11,12,13
2,"Retail and food services sales, total",583761,577319,679465,679473,702760,693577,685483,698833,660765,683198,684790,741521
3,Retail sales and food services excl motor vehi...,469700,459828,539027,542012,570623,561127,557906,562924,535423,556461,567249,618540
4,Retail sales and food services excl gasoline s...,536142,529214,616940,616286,631649,620064,613183,632519,600510,620095,627076,688622
5,Retail sales and food services excl motor vehi...,422081,411723,476502,478825,499512,487614,485606,496610,475168,493358,509535,565641
6,"Retail sales, total",516923,507901,598541,596690,616626,609743,599929,613508,577966,597170,605205,654825

In [12]:
melted_2022 = pd.melt(df_2022,id_vars="Kind of Business",var_name="Date",value_name="Sales")
melted_2022.head()

                                    Kind of Business        Date   Sales
0              Retail and food services sales, total  2022-01-01  583761
1  Retail sales and food services excl motor vehi...  2022-01-01  469700
2  Retail sales and food services excl gasoline s...  2022-01-01  536142
3  Retail sales and food services excl motor vehi...  2022-01-01  422081
4                                Retail sales, total  2022-01-01  516923